{
    "algorithms": [
        {"name": "Holt", 
         "params": [
            {"name":"alpha","type": "number"}, 
            {"name":"beta", "type":"number"}
         ],
         "description": "Этот метод включает уравнение прогноза и два уравнения сглаживания (одно для уровня и одно для тренда):Уравнение прогноза:y_t=ℓ_t+h*b_tУравнение уровня:ℓ_t=α*y_t+(1−α)(ℓ_t−1+b_{t−1}) Уравнение тренда:b_t=β∗(ℓ_t−ℓ_{t−1})+(1−β)b_{t−1} где ℓ_t обозначает оценку уровня ряда в момент времени t, b_t - оценку тренда (наклона) ряда в момент времени t,α - параметр сглаживания для уровня, 0≤α≤1, и β - параметр сглаживания для тренда, 0≤β≤1. "
        },  
        {"name": "LinearRegression",
         "params": [
            {"name": "window_size", "type": "number"}
         ],
         "description": ""
        },
        {"name": "Kalman Filter",
         "params": [
            {"name": "window_size", "type": "number"},
            {"name": "Transition matrix", "type": "matrix"},
            {"name": "Observation matrix", "type": "vector"},
            {"name": "Process noise", "type": "number"},
            {"name": "Measurement noise", "type": "number"}
         ],
         "description": "State Vector (Состояние системы): Мы используем двумерный вектор состояния для представления состояния системы. Первый элемент вектора представляет собой оценку текущего значения, а второй элемент представляет скорость изменения. Transition Matrix (Матрица перехода): Поскольку мы моделируем движение как изменение текущей цены и скорости изменения, мы используем матрицу перехода размером 2x2. Это позволяет нам обновлять и прогнозировать оба элемента вектора состояния.Measurement Vector (Измерения): В контексте прогнозирования на основе данных измерений, наш вектор измерений будет одномерным, представляя собой фактическое значение. Measurement Matrix (Матрица измерений): Поскольку наши измерения представляют собой просто текущее значение, наша матрица измерений будет 1x2. Это означает, что мы просто отбрасываем информацию о скорости изменения в нашем измерении."  },
        {"name": "SPS",
         "params": [
            {"name":"M","type": "number"}, 
            {"name":"q","type": "number"}  
     ],
     "description": "pivet"
     }
        ]
}